{"What did the fish say when it hit the wall?":[0],"How do you make a tissue dance?":[1],"What's Forrest Gump's password?":[2],"What do you call a belt made out of watches?":[3],"Why can't bicycles stand on their own?":[4],"How does a train eat?":[5],"What do you call a singing Laptop":[6],"How many lips does a flower have?":[7],"How do you organize an outer space party?":[8],"What kind of shoes does a thief wear?":[9],"What's the best time to go to the dentist?":[10],"Knock knock. \n Who's there? \n A broken pencil. \n A broken pencil who?":[11],"Knock knock. \n Who's there? \n Cows go. \n Cows go who?":[12],"Knock knock. \n Who's there? \n Little old lady. \n Little old lady who?":[13],"What's the best thing about a Boolean?":[14],"What's the object-oriented way to become wealthy?":[15],"Where do programmers like to hangout?":[16],"Why did the programmer quit his job?":[17],"Did you hear about the two silk worms in a race?":[18],"What do you call a laughing motorcycle?":[19],"A termite walks into a bar and says...":[20],"What does C.S. Lewis keep at the back of his wardrobe?":[21],"Why do programmers always mix up Halloween and Christmas?":[22],"A SQL query walks into a bar, walks up to two tables and asks...":[23],"How many programmers does it take to change a lightbulb?":[24],"If you put a million monkeys at a million keyboards, one of them will eventually write a Java program":[25],"['hip', 'hip']":[26],"To understand what recursion is...":[27],"There are 10 types of people in this world...":[28],"What did the duck say when he bought lipstick?":[29],"What happens to a frog's car when it breaks down?":[30,240],"did you know the first French fries weren't cooked in France?":[31],"Which song would an exception sing?":[32],"Knock knock. \n Who's there? \n Opportunity.":[33],"Why do Java programmers wear glasses?":[34],"Why did the mushroom get invited to the party?":[35,36],"I'm reading a book about anti-gravity...":[37],"If you're American when you go into the bathroom, and American when you come out, what are you when you're in there?":[38],"Want to hear a joke about a piece of paper?":[39],"I just watched a documentary about beavers.":[40],"If you see a robbery at an Apple Store...":[41],"A ham sandwhich walks into a bar and orders a beer. The bartender says...":[42],"Why did the Clydesdale give the pony a glass of water?":[43,323],"If you boil a clown...":[44],"Finally realized why my plant sits around doing nothing all day...":[45],"Don't look at the eclipse through a colander.":[46],"I bought some shoes from a drug dealer.":[47],"Why do chicken coops only have two doors?":[48],"What do you call a factory that sells passable products?":[49],"When a dad drives past a graveyard: Did you know that's a popular cemetery?":[50],"Why did the invisible man turn down the job offer?":[51],"How do you make holy water?":[52,128],"I had a dream that I was a muffler last night.":[53],"Why is peter pan always flying?":[54],"How do you check if a webpage is HTML5?":[55],"What do you call a cow with no legs?":[56,197],"I dropped a pear in my car this morning.":[57],"Lady: How do I spread love in this cruel world?":[58],"A user interface is like a joke.":[59],"Knock knock. \n Who's there? \n Hatch. \n Hatch who?":[60],"What do you call sad coffee?":[61],"Why did the butcher work extra hours at the shop?":[62],"Did you hear about the hungry clock?":[63],"Well...":[64],"Did you hear the story about the cheese that saved the world?":[65],"Did you watch the new comic book movie?":[66],"I started a new business making yachts in my attic this year...":[67],"I got hit in the head by a soda can, but it didn't hurt that much...":[68],"I can't tell if i like this blender...":[69],"I couldn't get a reservation at the library...":[70],"I was gonna tell you a joke about UDP...":[71],"The punchline often arrives before the set-up.":[72],"Why do C# and Java developers keep breaking their keyboards?":[73],"What do you give to a lemon in need?":[74],"Never take advice from electrons.":[75],"Hey, dad, did you get a haircut?":[76],"What time is it?":[77],"A weasel walks into a bar. The bartender says, \"Wow, I've never served a weasel before. What can I get for you?\"":[78],"Bad at golf?":[79],"Can a kangaroo jump higher than the Empire State Building?":[80],"Can February march?":[81],"Can I watch the TV?":[82],"Dad, can you put my shoes on?":[83],"Did you hear about the bread factory burning down?":[84],"Did you hear about the chameleon who couldn't change color?":[85],"Did you hear about the cheese factory that exploded in France?":[86],"Did you hear about the cow who jumped over the barbed wire fence?":[87],"Did you hear about the guy who invented Lifesavers?":[88],"Did you hear about the guy whose whole left side was cut off?":[89],"Did you hear about the kidnapping at school?":[90],"Did you hear about the Mexican train killer?":[91],"Did you hear about the new restaurant on the moon?":[92],"Did you hear about the runner who was criticized?":[93],"Did you hear about the scientist who was lab partners with a pot of boiling water?":[94],"Did you hear about the submarine industry?":[95],"Did you hear that David lost his ID in prague?":[96],"Did you hear that the police have a warrant out on a midget psychic ripping people off?":[97],"Did you hear the joke about the wandering nun?":[98],"Did you hear the news?":[99],"Did you hear the one about the guy with the broken hearing aid?":[100],"Did you know crocodiles could grow up to 15 feet?":[101],"What do ghosts call their true love?":[102],"Did you know that protons have mass?":[103],"Did you know you should always take an extra pair of pants golfing?":[104],"Do I enjoy making courthouse puns?":[105],"Do you know where you can get chicken broth in bulk?":[106],"Do you want a brief explanation of what an acorn is?":[107],"Ever wondered why bees hum?":[108],"Have you ever heard of a music group called Cellophane?":[109],"Have you heard of the band 1023MB?":[110],"Have you heard the rumor going around about butter?":[111],"How are false teeth like stars?":[112],"How can you tell a vampire has a cold?":[113],"How come a man driving a train got struck by lightning?":[114],"How come the stadium got hot after the game?":[115],"How did Darth Vader know what Luke was getting for Christmas?":[116],"How did the hipster burn the roof of his mouth?":[117],"How do hens stay fit?":[118],"How do locomotives know where they're going?":[119],"How do the trees get on the internet?":[120],"How do you find Will Smith in the snow?":[121],"How do you fix a broken pizza?":[122],"How do you fix a damaged jack-o-lantern?":[123],"How do you get a baby alien to sleep?":[124],"How do you get two whales in a car?":[125],"How do you know if there’s an elephant under your bed?":[126],"How do you make a hankie dance?":[127],"How do you organize a space party?":[129],"How do you steal a coat?":[130],"How do you tell the difference between a crocodile and an alligator?":[131],"How does a dyslexic poet write?":[132],"How does a French skeleton say hello?":[133],"How does a penguin build it’s house?":[134],"How does a scientist freshen their breath?":[135],"How does the moon cut his hair?":[136],"How many apples grow on a tree?":[137],"How many bones are in the human hand?":[138],"How many hipsters does it take to change a lightbulb?":[139],"How many kids with ADD does it take to change a lightbulb?":[140],"How many optometrists does it take to change a light bulb?":[141],"How many seconds are in a year?":[142],"How many South Americans does it take to change a lightbulb?":[143],"How many tickles does it take to tickle an octopus?":[144],"How much does a hipster weigh?":[145],"How was the snow globe feeling after the storm?":[146],"Is the pool safe for diving?":[147],"Is there a hole in your shoe?":[148],"What did the spaghetti say to the other spaghetti?":[149],"What’s 50 Cent’s name in Zimbabwe?":[150],"Want to hear a chimney joke?":[151],"Want to hear a joke about construction?":[152],"Want to hear my pizza joke?":[153],"What animal is always at a game of cricket?":[154],"What are the strongest days of the week?":[155],"What biscuit does a short person like?":[156],"What cheese can never be yours?":[157],"What creature is smarter than a talking parrot?":[158],"What did celery say when he broke up with his girlfriend?":[159],"What did Michael Jackson name his denim store?":[160],"What did one nut say as he chased another nut?":[161],"What did one plate say to the other plate?":[162],"What did one snowman say to the other snow man?":[163],"What did one wall say to the other wall?":[164],"What did Romans use to cut pizza before the rolling cutter was invented?":[165],"What did the 0 say to the 8?":[166],"What did the beaver say to the tree?":[167],"What did the big flower say to the littler flower?":[168],"What did the Buffalo say to his little boy when he dropped him off at school?":[169],"What did the digital clock say to the grandfather clock?":[170],"What did the dog say to the two trees?":[171],"What did the Dorito farmer say to the other Dorito farmer?":[172],"What did the fish say when it swam into a wall?":[173],"What did the grape do when he got stepped on?":[174],"What did the judge say to the dentist?":[175],"What did the late tomato say to the early tomato?":[176],"What did the left eye say to the right eye?":[177],"What did the mountain climber name his son?":[178],"What did the ocean say to the beach?":[179],"What did the ocean say to the shore?":[180],"Why don't you find hippopotamuses hiding in trees?":[181],"What did the pirate say on his 80th birthday?":[182],"What did the Red light say to the Green light?":[183],"What did the scarf say to the hat?":[184],"What did the shy pebble wish for?":[185],"What did the traffic light say to the car as it passed?":[186],"What did the Zen Buddist say to the hotdog vendor?":[187],"What do birds give out on Halloween?":[188],"What do I look like?":[189],"What do prisoners use to call each other?":[190],"What do vegetarian zombies eat?":[191],"What do you call a bear with no teeth?":[192],"What do you call a bee that lives in America?":[193],"What do you call a boomerang that won't come back?":[194],"What do you call a careful wolf?":[195],"What do you call a cow on a trampoline?":[196],"What do you call a cow with two legs?":[198],"What do you call a crowd of chess players bragging about their wins in a hotel lobby?":[199],"What do you call a dad that has fallen through the ice?":[200],"What do you call a dictionary on drugs?":[201],"what do you call a dog that can do magic tricks?":[202],"What do you call a droid that takes the long way around?":[203],"What do you call a duck that gets all A's?":[204],"What do you call a fake noodle?":[205],"What do you call a fashionable lawn statue with an excellent sense of rhythmn?":[206],"What do you call a fat psychic?":[207],"What do you call a fly without wings?":[208],"What do you call a girl between two posts?":[209],"What do you call a group of disorganized cats?":[210],"What do you call a group of killer whales playing instruments?":[211],"What do you call a monkey in a mine field?":[212],"What do you call a nervous javelin thrower?":[213],"What do you call a pig that knows karate?":[214],"What do you call a pig with three eyes?":[215],"What do you call a pile of cats?":[216],"What do you call a sheep with no legs?":[217],"What do you call a troublesome Canadian high schooler?":[218],"What do you call an alligator in a vest?":[219],"What do you call an Argentinian with a rubber toe?":[220],"What do you call an eagle who can play the piano?":[221],"What do you call an elephant that doesn’t matter?":[222],"What do you call an old snowman?":[223],"What do you call cheese by itself?":[224],"What do you call corn that joins the army?":[225],"What do you call someone with no nose?":[226],"What do you call two barracuda fish?":[227],"What do you do on a remote island?":[228],"What do you do when you see a space man?":[229],"What do you get hanging from Apple trees?":[230],"What do you get when you cross a bee and a sheep?":[231],"What do you get when you cross a chicken with a skunk?":[232],"What do you get when you cross a rabbit with a water hose?":[233],"What do you get when you cross a snowman with a vampire?":[234],"What do you give a sick lemon?":[235],"What does a clock do when it's hungry?":[236],"What does a female snake use for support?":[237],"What does a pirate pay for his corn?":[238],"What does an angry pepper do?":[239],"What happens when you anger a brain surgeon?":[241],"What has ears but cannot hear?":[242],"What is a centipedes's favorite Beatle song?":[243],"What is a tornado's favorite game to play?":[244],"What is a vampire's favorite fruit?":[245],"What is a witch's favorite subject in school?":[246],"What is red and smells like blue paint?":[247],"What is the difference between ignorance and apathy?":[248],"What is the hardest part about sky diving?":[249],"What is the leading cause of dry skin?":[250],"What is the least spoken language in the world?":[251],"What is the tallest building in the world?":[252],"What is this movie about?":[253],"What kind of award did the dentist receive?":[254],"What kind of bagel can fly?":[255],"What kind of dinosaur loves to sleep?":[256],"What kind of dog lives in a particle accelerator?":[257],"What kind of magic do cows believe in?":[258],"What kind of music do planets listen to?":[259],"What kind of pants do ghosts wear?":[260],"What kind of tree fits in your hand?":[261],"What lies at the bottom of the ocean and twitches?":[262],"What musical instrument is found in the bathroom?":[263],"What time did the man go to the dentist?":[264],"What type of music do balloons hate?":[265],"What was a more important invention than the first telephone?":[266],"What was the pumpkin’s favorite sport?":[267],"What's black and white and read all over?":[268],"What's blue and not very heavy?":[269],"What's brown and sticky?":[270],"What's orange and sounds like a parrot?":[271],"What's red and bad for your teeth?":[272],"What's the best thing about elevator jokes?":[273],"What's the difference between a guitar and a fish?":[274],"What's the difference between a hippo and a zippo?":[275],"What's the difference between a seal and a sea lion?":[276],"What's the worst part about being a cross-eyed teacher?":[277],"What's the worst thing about ancient history class?":[278],"What’s brown and sounds like a bell?":[279],"What’s E.T. short for?":[280],"What’s Forest Gump’s Facebook password?":[281],"What’s the advantage of living in Switzerland?":[282],"What’s the difference between an African elephant and an Indian elephant?":[283],"When do doctors get angry?":[284],"When does a joke become a dad joke?":[285],"When is a door not a door?":[286],"Where did you learn to make ice cream?":[287],"Where do bees go to the bathroom?":[288],"Where do hamburgers go to dance?":[289],"Where do rabbits go after they get married?":[290],"Where do sheep go to get their hair cut?":[291],"Where do you learn to make banana splits?":[292],"Where do young cows eat lunch?":[293],"Where does batman go to the bathroom?":[294],"Where does Fonzie like to go for lunch?":[295],"Where does Napoleon keep his armies?":[296],"Where was the Declaration of Independence signed?":[297],"Where’s the bin?":[298],"Which side of the chicken has more feathers?":[299],"Who did the wizard marry?":[300],"Who is the coolest Doctor in the hospital?":[301],"Why are fish easy to weigh?":[302],"Why are fish so smart?":[303],"Why are ghosts bad liars?":[304],"Why are graveyards so noisy?":[305],"Why are mummys scared of vacation?":[306],"Why are oranges the smartest fruit?":[307],"Why are pirates called pirates?":[308],"Why are skeletons so calm?":[309],"Why can't a bicycle stand on its own?":[310],"Why can't you use \"Beef stew\"as a password?":[311],"Why can't your nose be 12 inches long?":[312],"Why can’t you hear a pterodactyl go to the bathroom?":[313],"Why couldn't the kid see the pirate movie?":[314],"Why couldn't the lifeguard save the hippie?":[315],"Why did Dracula lie in the wrong coffin?":[316],"Why did Sweden start painting barcodes on the sides of their battleships?":[317],"Why did the A go to the bathroom and come out as an E?":[318],"Why did the barber win the race?":[319],"Why did the belt go to prison?":[320],"Why did the burglar hang his mugshot on the wall?":[321],"Why did the chicken get a penalty?":[322],"Why did the coffee file a police report?":[324],"Why did the cookie cry?":[325,326],"Why did the cowboy have a weiner dog?":[327],"Why did the fireman wear red, white, and blue suspenders?":[328],"Why did the girl smear peanut butter on the road?":[329],"Why did the half blind man fall in the well?":[330],"Why did the house go to the doctor?":[331],"Why did the kid cross the playground?":[332],"Why did the man put his money in the freezer?":[333],"Why did the man run around his bed?":[334],"Why did the melons plan a big wedding?":[335],"Why did the octopus beat the shark in a fight?":[336],"Why did the opera singer go sailing?":[337],"Why did the scarecrow win an award?":[338],"Why did the tomato blush?":[339],"Why did the tree go to the dentist?":[340],"Why did the worker get fired from the orange juice factory?":[341],"Why didn't the number 4 get into the nightclub?":[342],"Why didn’t the orange win the race?":[343],"Why didn’t the skeleton cross the road?":[344],"Why do bananas have to put on sunscreen before they go to the beach?":[345],"Why do bears have hairy coats?":[346],"Why do bees have sticky hair?":[347],"Why do bees hum?":[348],"Why do birds fly south for the winter?":[349],"Why do choirs keep buckets handy?":[350],"Why do crabs never give to charity?":[351],"Why do ducks make great detectives?":[352],"Why do mathematicians hate the U.S.?":[353],"Why do pirates not know the alphabet?":[354],"Why do pumpkins sit on people’s porches?":[355],"Why do scuba divers fall backwards into the water?":[356],"Why do trees seem suspicious on sunny days?":[357],"Why do valley girls hang out in odd numbered groups?":[358],"Why do wizards clean their teeth three times a day?":[359],"Why do you never see elephants hiding in trees?":[360],"Why does a chicken coop only have two doors?":[361],"Why does a Moon-rock taste better than an Earth-rock?":[362],"Why does it take longer to get from 1st to 2nd base, than it does to get from 2nd to 3rd base?":[363],"Why does Norway have barcodes on their battleships?":[364],"Why does Superman get invited to dinners?":[365],"Why does Waldo only wear stripes?":[366],"Knock-knock.":[367],"What's the best part about TCP jokes?":[368],"A programmer puts two glasses on his bedside table before going to sleep.":[369],"There are 10 kinds of people in this world.":[370],"Two guys walk into a bar . . .":[371],"What did the router say to the doctor?":[372],"An IPv6 packet is walking out of the house.":[373],"A DHCP packet walks into a bar and asks for a beer.":[374],"3 SQL statements walk into a NoSQL bar. Soon, they walk out":[375],"I saw a nice stereo on Craigslist for $1. Seller says the volume is stuck on ‘high’":[376],"My older brother always tore the last pages of my comic books, and never told me why.":[377]}